src/cf/Documents/ВводНачальныхОстатковНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВводНачальныхОстатковНоменклатуры</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/ОстаткиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектПредприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Documents/ВводНачальныхОстатковНоменклатуры/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	
	// Определить, нужно ли обновлять дату в движениях 
	ОбновитьДатуДвижений = ЭтоНовый() Или Движения.ОстаткиНоменклатуры.Модифицированность(); 
	
	Если Не ОбновитьДатуДвижений Тогда 
		// Проверить, что дата изменилась 
		Запрос = Новый Запрос; 
		Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка); 
		Запрос.Текст = 
		"ВЫБРАТЬ 
		| Дата 
		|ИЗ
		| Документ.ВводНачальныхОстатковНоменклатуры 
		|ГДЕ Ссылка = &ТекущийДокумент"; 
		Выборка = Запрос.Выполнить().Выбрать(); 
		Выборка.Следующий(); 
		ОбновитьДатуДвижений = Выборка.Дата <> Дата; 
	КонецЕсли; 
	
	// Установить всем новую дату, если нужно 
	Если ОбновитьДатуДвижений Тогда 
		Если Не Движения.ОстаткиНоменклатуры.Выбран() И 
			Не Движения.ОстаткиНоменклатуры.Модифицированность() Тогда 
			Движения.ОстаткиНоменклатуры.Прочитать(); 
		КонецЕсли; 
		Для Каждого ЗаписьРегистра Из Движения.ОстаткиНоменклатуры Цикл 
			ЗаписьРегистра.Период = Дата; 
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры



&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Для Каждого ЗаписьРегистра Из Объект.Движения.ОбъектПредприятия Цикл 
		ЗаписьРегистра.Период = Объект.Дата; 
	КонецЦикла; 
	
КонецПроцедуры
